// 2. Вивести в консоль всі парні числа від 2 до 20 за допомогою циклу for. Якщо число парне, пропустити його за допомогою continue.
for (let i=2; i <= 20; i+=1) {
    if (i%2===0) {
        console.log(i);
    }
}

// 3. Вивести в консоль таблицю множення числа 7 за допомогою циклу for.
for (let i=0; i<=10; i+=1) {
    console.log(`7 * ${i} = ${i*7}`);
}

// 4. Створити скрипт, який виводить в консоль всі числа , які менші за n. Якщо зустрічається число, що більше або дорівнює n, цикл повинен бути закінчений за допомогою break.
const n = 20;

for (let i=0; i<=100; i+=1) {
    if (i <= n) {
        console.log(i);
    }
    else {
        break;
    }
}